" vimrc 文件中的注释以 " 开头。
" 如果你在 Vim 中打开这个文件，它会有语法高亮。

" Vim 是基于 Vi 的。设置 nocompatible 会关闭默认的 Vi 兼容模式，
" 并启用有用的 Vim 功能。对于名为 '~/.vimrc' 的文件来说，这个配置选项其实不是必需的，
" 因为如果该文件存在，Vim 会自动进入非兼容模式。但我们在这里还是加上了它，
" 以防这个配置文件以其他方式加载（例如，保存为 foo，然后用 vim -u foo 启动 Vim）。
set nocompatible

" 开启语法高亮。
syntax on

" 禁用默认的 Vim 启动信息。
set shortmess+=I

" 显示行号。
set number

" 始终在底部显示状态栏，即使你只打开一个窗口。
set laststatus=2

" 退格键默认行为有点不直观。例如，默认情况下，
" 你不能在用 'i' 设置的插入点之前退格。
" 这个配置使退格键的行为更合理，你可以退格删除任何东西。
set backspace=indent,eol,start

" 默认情况下, Vim 不允许你隐藏有未保存更改的缓冲区
" (即, 缓冲区没有在任何窗口中显示)。这是为了防止你忘记未保存的更改,
" 然后通过 :qa! 等命令退出。我们发现隐藏缓冲区很有用, 所以禁用了这个保护。
" 更多信息请查看 :help hidden。
set hidden

" 这个设置使得在搜索字符串中所有字符都是小写时, 搜索不区分大小写。
" 但是, 如果搜索字符串包含任何大写字母, 搜索就会变为区分大小写。
" 这使得搜索更加方便。
set ignorecase
set smartcase

" 在你输入时就进行搜索, 而不是等到你按下回车键。
set incsearch

" 解绑一些无用/烦人的默认键位绑定。
" 在普通模式下, 'Q' 会进入 Ex 模式, 你几乎永远不会想用这个。
nmap Q <Nop>

" 禁用烦人的声音提示。
set noerrorbells visualbell t_vb=

" 启用鼠标支持。你应该避免过度依赖这个功能, 但它有时会很方便。
set mouse+=a

" 尝试戒除使用方向键移动光标的坏习惯。
" 这不是唯一可能的坏习惯。例如, 按住 h/j/k/l 键来移动,
" 而不是使用更高效的移动命令, 也是一个坏习惯。
" 前者可以通过 .vimrc 来强制, 但我们不知道如何防止后者。
" 在普通模式下禁用方向键...

